# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.


# username = input("Введите ваше имя")
# age = int(input("Введите ваш возраст"))
# born = input("Где вы родились")
# year = int(input("Введите год рождения"))
# bool = True
# print(f"Ваше имя {username}, Ваш возраст {age}, Вы родились в городе {born} В {year} году!")


text_variable = "Jhon Doe" # переменная текст
integer_variable = 10 # переменная интеджер - целое число
float_variable = 13.7 # переменная флоат = с плавающей запятой
boolean_variable = False # переменая булевого значения

user_name = input("Введите ваше имя >>> ") # вводим имя
print(user_name) # выводим имя

user_age = input("Введите ваш возраст >>> ") # вводим возраст
print(user_age) # выводим возраст